УТ_для_edt/src/Documents/смартРегламентноеОбслуживаниеКлиентов/смартРегламентноеОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартРегламентноеОбслуживаниеКлиентов</name>
  <comment>// смарт:ММ #099 409 25.03.2021</comment>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТОУКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЗамены</name>
    <type>
      <types>EnumRef.смартСрокиЗаменыЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписанияАктаНаПНР</name>
    <comment>// 03.12.2020</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>//смарт:ММ 30.05.2021</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>DocumentRef.смартЗаявкаНаПускоНаладку</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>EnumRef.смартСтатусыРегламентногоОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначенныйМенеджерСЦ</name>
    <comment>//смарт:ММ 30.08.2021</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Запчасть</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Documents/смартРегламентноеОбслуживаниеКлиентов/ManagerModule.bsl
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	
КонецПроцедуры

//++ смарт:ММ #099 409 05.06.2021
Функция ПолучитьСерию(Оборудование, ЗаявкаНаПНР) Экспорт
	
	Серия = Неопределено;
	
	Если НЕ ЗначениеЗаполнено(Оборудование)
		ИЛИ НЕ ЗначениеЗаполнено(ЗаявкаНаПНР) Тогда
		Возврат Серия;	
	КонецЕсли;
		
	Отбор = Новый Структура;
	Отбор.Вставить("ОборудованиеКлиентов", Оборудование);
	НайденныеСтроки = ЗаявкаНаПНР.Оборудование.НайтиСтроки(Отбор);
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		Серия = НайденныеСтроки[0].Серия;	
	КонецЕсли;
	
	Возврат Серия;	
	
КонецФункции //-- смарт:ММ 05.06.2021

#КонецОбласти
